ERP DEV.WMS/src/DataProcessors/вмс_ИнтерактивноеРедактированиеКартыСклада/вмс_ИнтерактивноеРедактированиеКартыСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_ИнтерактивноеРедактированиеКартыСклада</name>
  <comment>ТУ_Августинович 000056225 27.08.2025</comment>
</mdclass:DataProcessor>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_ХранениеКартСкладов/вмс_ХранениеКартСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ХранениеКартСкладов</name>
  <comment>ТУ_Августинович 29.08.2025</comment>
  <resources>
    <name>СвойстваКартыСклада</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/вмс_ТипыОбъектовСклада/вмс_ТипыОбъектовСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыОбъектовСклада</name>
  <comment>ТУ_Августинович 27.08.2025</comment>
  <enumValues>
    <name>Стеллаж</name>
  </enumValues>
  <enumValues>
    <name>НеРабочаяЗона</name>
  </enumValues>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Служебные</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_МестаХранения/вмс_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_МестаХранения</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЯчейки</name>
    <type>
      <types>EnumRef.вмс_ТипыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЯчеекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаНомер</name>
    <comment>Сквозная в длину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаРяд</name>
    <comment>Сквозная в ширину нумерация (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СортировкаЭтаж</name>
    <comment>Нумерация в высоту (техническая)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаБезразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТехническое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСверху</name>
    <comment>ТУ_Августинович 000056225 28.10.2025. Для интерактивной карты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСклад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияРяд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияСтеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияЯрус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастьНаименованияМесто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/DataProcessors/вмс_ИнтерактивноеРедактированиеКартыСклада/Forms/ФормаКартаСклада/Module.bsl
#Область ТипыОбъектовСклада


&НаСервере
Функция ТипыОбъектовСклада()
	Возврат Перечисления.вмс_ТипыОбъектовСклада;
КонецФункции

&НаСервере
Функция ЭтоСтеллаж(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().Стеллаж = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоНеРабочаяЗона(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().НеРабочаяЗона = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоЗонаПриемки(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().ЗонаПриемки = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоЗонаОтбора(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().ЗонаОтбора = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоЗонаКонтроля(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().ЗонаКонтроля = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоЗонаОтгрузки(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().ЗонаОтгрузки = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоКарантин(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().Карантин = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоСлужебные(ТипОбъектаСклада)
	Возврат ТипыОбъектовСклада().Служебные = ТипОбъектаСклада;
КонецФункции

&НаСервере
Функция ЭтоОднаИзРабочихЗон(ТипОбъектаСклада)
	Возврат ЭтоЗонаПриемки(ТипОбъектаСклада)
			ИЛИ ЭтоЗонаОтбора(ТипОбъектаСклада)
			ИЛИ ЭтоЗонаКонтроля(ТипОбъектаСклада)
			ИЛИ ЭтоЗонаОтгрузки(ТипОбъектаСклада)
			ИЛИ ЭтоКарантин(ТипОбъектаСклада)
			//ИЛИ ЭтоСлужебные(ТипОбъектаСклада)
	;
КонецФункции


&НаСервере
Процедура ЗаполннитьТипОбъектовИСвойстваЗаполнения(Знач ТипОбъектаИСвойстваЗаполнения, ТипОбъекта, Цвет = Неопределено, Узор = Неопределено)
	СвойстваЗаполнения = Новый Структура("Цвет, Узор");
	СвойстваЗаполнения.Цвет = Цвет;
	СвойстваЗаполнения.Узор = Узор;
	ТипОбъектаИСвойстваЗаполнения.Вставить(ТипОбъекта, СвойстваЗаполнения);
КонецПроцедуры

&НаСервере
Функция ТипОбъектаИСвойстваЗаполнения()
	ТипОбъектаИСвойстваЗаполнения = Новый Соответствие;
	
	// Стеллаж
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().Стеллаж
											, WebЦвета.Золотистый
											, ТипУзораТабличногоДокумента.БезУзора);
	
	// НеРабочаяЗона
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().НеРабочаяЗона
											, WebЦвета.Белый
											, ТипУзораТабличногоДокумента.Узор8);
	
	// ЗонаПриемки
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().ЗонаПриемки
											, WebЦвета.ЛимонноЗеленый
											, ТипУзораТабличногоДокумента.БезУзора);
	
	// ЗонаОтбора
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().ЗонаОтбора
											, WebЦвета.Голубой
											, ТипУзораТабличногоДокумента.БезУзора);
	
	// ЗонаКонтроля
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().ЗонаКонтроля
											, WebЦвета.ТемноОранжевый
											, ТипУзораТабличногоДокумента.БезУзора);
	
	// ЗонаОтгрузки
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().ЗонаОтгрузки
											, WebЦвета.ОранжевоКрасный
											, ТипУзораТабличногоДокумента.БезУзора);
	
	// Карантин
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().Карантин
											, WebЦвета.Томатный
											, ТипУзораТабличногоДокумента.БезУзора);
	
	// Служебные
	ЗаполннитьТипОбъектовИСвойстваЗаполнения(ТипОбъектаИСвойстваЗаполнения
											, ТипыОбъектовСклада().Служебные
											, WebЦвета.СветлоСерый
											, ТипУзораТабличногоДокумента.БезУзора);
	
	Возврат ТипОбъектаИСвойстваЗаполнения;
КонецФункции

#КонецОбласти


#Область ОбъектыСклада

&НаСервере
Функция СписокМестХранения(Владелец, ВидСверху)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.ЧастьНаименованияЯрус КАК ЧастьНаименованияЯрус,
	|	вмс_МестаХранения.ЧастьНаименованияМесто КАК ЧастьНаименованияМесто,
	|	вмс_МестаХранения.Ссылка КАК Ссылка,
	|	вмс_МестаХранения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.ВидСверху = &ВидСверху
	|	И НЕ вмс_МестаХранения.ЭтоГруппа
	|	И вмс_МестаХранения.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧастьНаименованияЯрус УБЫВ,
	|	ЧастьНаименованияМесто
	|ИТОГИ ПО
	|	ЧастьНаименованияЯрус";
	Запрос.УстановитьПараметр("Владелец",	Владелец);
	Запрос.УстановитьПараметр("ВидСверху",	ВидСверху);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Функция СписокМестХраненияСИндикациейЗаполнености(Стеллаж)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец",	Склад);
	Запрос.УстановитьПараметр("ВидСверху",	Стеллаж);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.ЧастьНаименованияЯрус КАК ЧастьНаименованияЯрус,
	|	вмс_МестаХранения.ЧастьНаименованияМесто КАК ЧастьНаименованияМесто,
	|	вмс_МестаХранения.Ссылка КАК Ссылка,
	|	вмс_МестаХранения.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТ_Ячейки
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.ВидСверху = &ВидСверху
	|	И НЕ вмс_МестаХранения.ЭтоГруппа
	|	И вмс_МестаХранения.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка КАК Ячейка,
	|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Объем КАК ЯчейкаОбъем,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	|	вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель КАК ТоварОбъемЧислитель,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток * вмс_ОперацияПоЯчейкамОстатки.Товар.ОбъемЧислитель КАК ОбъемНаЯчейке,
	|	ВЫБОР
	|		КОГДА вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток > 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Пустая
	|ПОМЕСТИТЬ ВТ_РН_ОперацииПоЯчейкам
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(
	|			,
	|			Ячейка В
	|				(ВЫБРАТЬ
	|					ВТ_Ячейки.Ссылка
	|				ИЗ
	|					ВТ_Ячейки КАК ВТ_Ячейки)) КАК вмс_ОперацияПоЯчейкамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РН_ОперацииПоЯчейкам.Ячейка КАК Ячейка,
	|	СУММА(ЕСТЬNULL(ВТ_РН_ОперацииПоЯчейкам.ОбъемНаЯчейке, 0)) КАК ОбъемНаЯчейке,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_РН_ОперацииПоЯчейкам.ЯчейкаОбъем, 0)) КАК ЯчейкаОбъем,
	|	ВТ_РН_ОперацииПоЯчейкам.Пустая КАК Пустая
	|ПОМЕСТИТЬ ВТ_Сгруппированные
	|ИЗ
	|	ВТ_РН_ОперацииПоЯчейкам КАК ВТ_РН_ОперацииПоЯчейкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РН_ОперацииПоЯчейкам.Ячейка,
	|	ВТ_РН_ОперацииПоЯчейкам.Пустая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сгруппированные.Ячейка КАК Ячейка,
	|	ВТ_Сгруппированные.Ячейка.Наименование КАК ИмяЯчейки,
	|	ВЫБОР
	|		КОГДА ВТ_Сгруппированные.ЯчейкаОбъем = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Сгруппированные.ОбъемНаЯчейке * 100 / ВТ_Сгруппированные.ЯчейкаОбъем
	|	КОНЕЦ КАК Заполненность,
	|	ВТ_Сгруппированные.Пустая КАК Пустая
	|ПОМЕСТИТЬ ВТ_ЯчейкиСПроцентомЗаполнености
	|ИЗ
	|	ВТ_Сгруппированные КАК ВТ_Сгруппированные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ячейки.ЧастьНаименованияЯрус КАК ЧастьНаименованияЯрус,
	|	ВТ_Ячейки.ЧастьНаименованияМесто КАК ЧастьНаименованияМесто,
	|	ВТ_Ячейки.Ссылка КАК Ячейка,
	|	ВТ_Ячейки.Наименование КАК ИмяЯчейки,
	|	ЕСТЬNULL(ВТ_ЯчейкиСПроцентомЗаполнености.Заполненность, 0) КАК Заполненность,
	|	ЕСТЬNULL(ВТ_ЯчейкиСПроцентомЗаполнености.Пустая, ИСТИНА) КАК Пустая
	|ИЗ
	|	ВТ_Ячейки КАК ВТ_Ячейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЯчейкиСПроцентомЗаполнености КАК ВТ_ЯчейкиСПроцентомЗаполнености
	|		ПО ВТ_Ячейки.Ссылка = ВТ_ЯчейкиСПроцентомЗаполнености.Ячейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧастьНаименованияЯрус УБЫВ,
	|	ИмяЯчейки
	|ИТОГИ ПО
	|	ЧастьНаименованияЯрус";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеСтеллажа = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДанныеСтеллажа.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Цвет"));
	
	ЦветЗаполнения = Неопределено;
	
	Для каждого Ярус Из ДанныеСтеллажа.Строки Цикл
		Для каждого Ячейка Из Ярус.Строки Цикл
			Если ИспользуетсяВГХ Тогда
				Если Ячейка.Заполненность > 75 Тогда
					Ячейка.Цвет = WebЦвета.Томатный;
				ИначеЕсли Ячейка.Заполненность > 50 Тогда
					Ячейка.Цвет = WebЦвета.Оранжевый;
				ИначеЕсли Ячейка.Заполненность > 25 Тогда
					Ячейка.Цвет = WebЦвета.СветлоЗолотистый;
				Иначе
					Ячейка.Цвет = WebЦвета.ЖелтоЗеленый;
				КонецЕсли;
			Иначе
				Ячейка.Цвет = ?(Ячейка.Пустая, WebЦвета.Белый, WebЦвета.СветлоСерый);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеСтеллажа;
КонецФункции


&НаСервере
Функция СписокОбъектовСклада(Склад)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_МестаХранения.ВидСверху КАК ОбъектСклада,
	|	вмс_МестаХранения.ТипЯчейки КАК ТипЯчейки
	|ПОМЕСТИТЬ ВТ_ОбъектыСклада
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Владелец = &Склад
	|	И НЕ вмс_МестаХранения.ВидСверху В (&ОбъектыСклада)
	|	И вмс_МестаХранения.ВидСверху <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_МестаХранения.ВидСверху,
	|	вмс_МестаХранения.ТипЯчейки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вмс_МестаХранения.Наименование,
	|	вмс_МестаХранения.ТипЯчейки
	|ИЗ
	|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
	|ГДЕ
	|	вмс_МестаХранения.Владелец = &Склад
	|	И НЕ вмс_МестаХранения.Наименование В (&ОбъектыСклада)
	|	И вмс_МестаХранения.ТипЯчейки <> ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.Хранение)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_МестаХранения.Наименование,
	|	вмс_МестаХранения.ТипЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_ТипыЯчеек.Ссылка КАК ТипЯчейки,
	|	ВЫБОР
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.Хранение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.Стеллаж)
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаПриемки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.ЗонаПриемки)
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтгрузки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.ЗонаОтгрузки)
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаОтбора)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.ЗонаОтбора)
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.ЗонаКонтроля)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.ЗонаКонтроля)
	|		КОГДА вмс_ТипыЯчеек.Ссылка = ЗНАЧЕНИЕ(Перечисление.вмс_ТипыЯчеек.Карантин)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.Карантин)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.вмс_ТипыОбъектовСклада.Служебные)
	|	КОНЕЦ КАК ТипОбъектовСклада
	|ПОМЕСТИТЬ ВТ_ТипыОбъектовСклада
	|ИЗ
	|	Перечисление.вмс_ТипыЯчеек КАК вмс_ТипыЯчеек,
	|	Перечисление.вмс_ТипыОбъектовСклада КАК вмс_ТипыОбъектовСклада
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТипыОбъектовСклада.ТипЯчейки КАК ТипЯчейки,
	|	ВТ_ТипыОбъектовСклада.ТипОбъектовСклада КАК ТипОбъектовСклада
	|ПОМЕСТИТЬ ВТ_ТипыОбъектовСкладаСГруппировкой
	|ИЗ
	|	ВТ_ТипыОбъектовСклада КАК ВТ_ТипыОбъектовСклада
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТипыОбъектовСклада.ТипЯчейки,
	|	ВТ_ТипыОбъектовСклада.ТипОбъектовСклада
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбъектыСклада.ОбъектСклада КАК ОбъектСклада,
	|	ВТ_ТипыОбъектовСкладаСГруппировкой.ТипОбъектовСклада КАК ТипОбъектаСклада
	|ИЗ
	|	ВТ_ОбъектыСклада КАК ВТ_ОбъектыСклада
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипыОбъектовСкладаСГруппировкой КАК ВТ_ТипыОбъектовСкладаСГруппировкой
	|		ПО ВТ_ОбъектыСклада.ТипЯчейки = ВТ_ТипыОбъектовСкладаСГруппировкой.ТипЯчейки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектСклада";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ОбъектыСклада",	МетаданныеКарты.Выгрузить().ВыгрузитьКолонку("ОбъектСклада"));
	СписокОбъектовСклада = Запрос.Выполнить().Выгрузить();
	
	НеРабочаяЗона = СписокОбъектовСклада.Добавить();
	НеРабочаяЗона.ОбъектСклада		= "Не рабочая зона";
	НеРабочаяЗона.ТипОбъектаСклада	= Перечисления.вмс_ТипыОбъектовСклада.НеРабочаяЗона;
	
	Возврат СписокОбъектовСклада;
КонецФункции


#КонецОбласти


#Область РаботаСТабличнымиДокументами

&НаСервере
Процедура УстановитьРазмерыЯчеек(Высота = 2, Ширина = 2)
	//КартаСклада.Область().ВысотаСтроки	= Высота;
	КартаСклада.Область().ШиринаКолонки	= Ширина;
КонецПроцедуры


&НаСервере
Процедура ОбъединитьОбласть(ИмяОбласти)
	
	Область = КартаСклада.Область(ИмяОбласти);
	Область.Объединить();
	Область.ВертикальноеПоложение	= ВертикальноеПоложение.Центр;
	Область.ГоризонтальноеПоложение	= ГоризонтальноеПоложение.Центр;
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьОриентациюТекстаВОбласти(Область)
	
	//Область = КартаСклада.Область(ИмяОбласти);
	ПерваяСтрока	 = Область.Верх;
	ПерваяКолонка	 = Область.Лево;
	ПоследняяСтрока	 = Область.Низ;
	ПоследняяКолонка = Область.Право;
	
	КоличествоКолонок = ПоследняяКолонка - ПерваяКолонка + 1;
	КоличествоСтрок	  = ПоследняяСтрока - ПерваяСтрока + 1;
	
	
	Если КоличествоСтрок > КоличествоКолонок Тогда
		Область.ОриентацияТекста = 90;
	Иначе
		Область.ОриентацияТекста = 0;
	КонецЕсли;
	
	//Область.ОриентацияТекста = Число(?(КоличествоСтрок > КоличествоКолонок, 90, 0));
КонецПроцедуры


&НаКлиенте
Процедура ПодставитьПолеШаблона(Область, ВыбраннаяСтрока)
	// Перед началом добавления необходимо выделить область в табличном документе.
	Если ТипЗнч(Область) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ТекстСообщения = НСтр("ru = 'Для переноса нужно выделить ячейку или область ячеек'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения);
		Возврат;
	Иначе
		ТекущаяОбласть = Область;
		ОбъединитьОбласть(ТекущаяОбласть.Имя);
	КонецЕсли;
	
	// Подготовка данных.
	ТекущиеДанные	 = ОбъектыСклада.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ТипОбъектаСклада = ТекущиеДанные.ТипОбъектаСклада;
	ОбъектСклада	 = ТекущиеДанные.ОбъектСклада;
	
	СвойстваЗаполнения = ТипОбъектаИСвойстваЗаполнения()[ТипОбъектаСклада];
	
	ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ТекущаяОбласть.Текст	  = ?(ЭтоНеРабочаяЗона(ТипОбъектаСклада), "", ОбъектСклада);
	
	НайденныеСтроки = МетаданныеКарты.НайтиСтроки(Новый Структура("ОбъектСклада", ОбъектСклада));
	
	Если НайденныеСтроки.Количество() = 0 ИЛИ ЭтоНеРабочаяЗона(ТипОбъектаСклада) Тогда
		НовыеДанные = МетаданныеКарты.Добавить();
		НовыеДанные.ОбъектСклада	 = ОбъектСклада;
		НовыеДанные.Область			 = ТекущаяОбласть.Имя;
		НовыеДанные.Цвет			 = СвойстваЗаполнения.Цвет;
		НовыеДанные.ТипОбъектаСклада = ТипОбъектаСклада;
	Иначе
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Область = ТекущаяОбласть.Имя;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьОтображениеКарты();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьКартуИзМетоданных()
	ИменаЯчеек = МетаданныеКарты.Выгрузить().ВыгрузитьКолонку("ОбъектСклада");
	
	Для каждого СтрокаДанных Из МетаданныеКарты Цикл
		ОбъектСклада = ?(ЭтоНеРабочаяЗона(СтрокаДанных.ТипОбъектаСклада), "", СтрокаДанных.ОбъектСклада);
		ЗаполнитьОбласть(ОбъектСклада, СтрокаДанных.Область, СтрокаДанных.Цвет, ТипОбъектаИСвойстваЗаполнения()[СтрокаДанных.ТипОбъектаСклада].Узор);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОбласть(ОбъектСклада, ИмяОбласти, Цвет, Узор)
	ТекущаяОбласть = КартаСклада.Область(ИмяОбласти);
	ОбъединитьОбласть(ТекущаяОбласть.Имя);
	
	ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
	ТекущаяОбласть.Текст	  = ОбъектСклада;
	
	ИзменитьОриентациюТекстаВОбласти(ТекущаяОбласть);
	
	ЗакраситьГраницыОбласти(ТекущаяОбласть);
	ЗакраситьОбласть(ТекущаяОбласть, Цвет, Узор);
КонецПроцедуры


&НаСервере
Процедура ЗакраситьОбласть(Область, Цвет = Неопределено, Узор = Неопределено)
	Если НЕ ЗначениеЗаполнено(Цвет) И ТипЗнч(Цвет) <> Тип("Цвет") Тогда
		ТекстСообщения = НСтр("ru = 'Не указан цвет ячейки'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		Область.ЦветФона = Цвет;
		Область.Узор = ?(ЗначениеЗаполнено(Узор), Узор, ТипУзораТабличногоДокумента.БезУзора);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗакраситьГраницыОбласти(Область, ГраницаСлева = Истина, ГраницаСправа = Истина, ГраницаСверху = Истина, ГраницаСнизу = Истина)
	Если ГраницаСлева Тогда
		Область.ГраницаСлева  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2, );
	КонецЕсли;
	
	Если ГраницаСправа Тогда
		Область.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2, );
	КонецЕсли;
	
	Если ГраницаСверху Тогда
		Область.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2, );
	КонецЕсли;
	
	Если ГраницаСнизу Тогда
		Область.ГраницаСнизу  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2, );
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОткрытиеСохраненнойКарты()
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		ТекстСообщения = "Выберите склад";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Склад");
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.вмс_ХранениеКартСкладов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Склад = Склад;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		СохраненныеДанные = МенеджерЗаписи.СвойстваКартыСклада.Получить();
		
		Если ЗначениеЗаполнено(СохраненныеДанные) И ТипЗнч(СохраненныеДанные) = Тип("ТаблицаЗначений") Тогда
			МетаданныеКарты.Загрузить(СохраненныеДанные);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьКартуИзМетоданных();
КонецПроцедуры


&НаСервере
Функция ВхождениеОднойОбластиВДругую(ОбластьСодержимая, ОбластьСодержащая)
	// Координаты ОбластьСодержимая
    ПерваяСтрока1		= ОбластьСодержимая.Верх;
    ПерваяКолонка1		= ОбластьСодержимая.Лево;
    ПоследняяСтрока1	= ОбластьСодержимая.Низ;
    ПоследняяКолонка1	= ОбластьСодержимая.Право;

    // Координаты ОбластьСодержащая
    ПерваяСтрока2		= ОбластьСодержащая.Верх;
    ПерваяКолонка2		= ОбластьСодержащая.Лево;
    ПоследняяСтрока2	= ОбластьСодержащая.Низ;
    ПоследняяКолонка2	= ОбластьСодержащая.Право;

    // Проверка вхождения по вертикали
    ПоВертикали	  = (ПерваяСтрока1 >= ПерваяСтрока2) И (ПоследняяСтрока1 <= ПоследняяСтрока2);

    // Проверка вхождения по горизонтали
    ПоГоризонтали = (ПерваяКолонка1 >= ПерваяКолонка2) И (ПоследняяКолонка1 <= ПоследняяКолонка2);

    // Если Вхождение есть по обоим направлениям, то одна область содержит другую
    Возврат ПоВертикали И ПоГоризонтали;
КонецФункции


&НаСервереБезКонтекста
Функция МакетДетализацияОбъектаСклада()
	Возврат Обработки.вмс_ИнтерактивноеРедактированиеКартыСклада.ПолучитьМакет("ДетализацияОбъектаСклада");
КонецФункции


&НаСервере
Процедура ДетализацияОбъектаСклада(ИмяОбъектаСклада)
	ДанныеСтеллажа = СписокМестХраненияСИндикациейЗаполнености(ИмяОбъектаСклада);
	
	Если ДанныеСтеллажа = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют данные по объекту склада");
		Возврат;
	КонецЕсли;
	
	Макет = МакетДетализацияОбъектаСклада();
	ОблОбъектСклада	= Макет.ПолучитьОбласть("ОбъектСклада");
	ОблЯрус			= Макет.ПолучитьОбласть("Ярус");
	
	ОтображениеСтеллажа.Очистить();
	ОтображениеСтеллажа.УстановитьРастягиваниеПоГоризонтали(Истина);
	// Заголовок
	Элементы.ОтображениеСтеллажа.Заголовок = ИмяОбъектаСклада;
	
	КоличестваМестНаЯрусах = Новый Массив;
	Ярусы = ДанныеСтеллажа.Строки;
	
	Для каждого Ярус Из Ярусы Цикл
		КоличестваМестНаЯрусах.Добавить(Ярус.Строки.Количество());
	КонецЦикла;
	
	НаименьшееОбщееКратное = НаименьшееОбщееКратноеДляМассиваЧисел(КоличестваМестНаЯрусах);
	
	НеВыбранаТекущаяОбласть	= Истина;
	ТекущаяОбласть			= Неопределено;
	
	// Отрисовка объекта склада
	Для каждого Ярус Из Ярусы Цикл
		Шаг = 1;
		ОблЯрус.Очистить();
		Смещение = НаименьшееОбщееКратное / Ярус.Строки.Количество() - 1;
		
		Для каждого Ячейка Из Ярус.Строки Цикл
			// ТУ_Августинович ++ 06.11.2025
			// - Вся эта конструкция только чтобы изменить ШиринуКолонок
			ОблЯчейка = ОблЯрус.Область(1, Шаг, 3, Шаг + Смещение);
			ОблЯчейка.СоздатьФорматСтрок();
			ОблЯчейка = ОблЯрус.Область(1, Шаг, 3, Шаг + Смещение);
			// ТУ_Августинович -- 06.11.2025
			
			Если НеВыбранаТекущаяОбласть Тогда
				ТекущаяОбласть = ОблЯчейка;
				
				ВыбранаТекущаяОбласть = Ложь;
			КонецЕсли;
			
			ОблЯчейка.Объединить();
			
			ОблЯчейка.Заполнение			  = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОблЯчейка.Текст					  = Ячейка.ИмяЯчейки; //  + " | " + Ячейка.Заполненность + "%"
			ОблЯчейка.ЦветФона				  = Ячейка.Цвет;
			ОблЯчейка.ВертикальноеПоложение	  = ВертикальноеПоложение.Центр;
			ОблЯчейка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			
			Если Смещение = 0 Тогда
				ОблЯчейка.ШиринаКолонки = СтрДлина(Ячейка.ИмяЯчейки) + 2;
			КонецЕсли;
			
			ЗакраситьГраницыОбласти(ОблЯчейка);
			
			Шаг = Шаг + Смещение + 1;
		КонецЦикла;
		
		ОтображениеСтеллажа.Вывести(ОблЯрус);
	КонецЦикла;
	
	Элементы.ОтображениеСтеллажа.ТекущаяОбласть = ТекущаяОбласть;
КонецПроцедуры

&НаСервере
Функция НаибольшийОбщийДелитель(Знач Первое, Знач Второе)
	Пока Второе <> 0 Цикл
		Остаток = Первое % Второе;
		Первое = Второе;
		Второе = Остаток;
	КонецЦикла;
	
	Возврат Первое;
КонецФункции

&НаСервере
Функция НаименьшееОбщееКратноеДляДвухЧисел(Знач Первое, Знач Второе)
	Возврат (Первое * Второе) / НаибольшийОбщийДелитель(Первое, Второе);
КонецФункции

&НаСервере
Функция НаименьшееОбщееКратноеДляМассиваЧисел(МассивЧисел)
	Если МассивЧисел.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ТекущееНОК = МассивЧисел[0];
	Для Индекс = 1 По МассивЧисел.Количество() - 1 Цикл
		ТекущееНОК = НаименьшееОбщееКратноеДляДвухЧисел(ТекущееНОК, МассивЧисел[Индекс]);
	КонецЦикла;
	Возврат ТекущееНОК;
КонецФункции


#КонецОбласти


&НаКлиенте
Процедура ОткрытьФормуОстаткиНаЯчейке(ИмяЯчейки, СкладВладелец)
	ПараметрыФормы = Новый Структура("ИмяЯчейки, Склад");
	ПараметрыФормы.ИмяЯчейки = ИмяЯчейки;
	ПараметрыФормы.Склад	 = СкладВладелец;
	
	ОткрытьФорму("Обработка.вмс_ИнтерактивноеРедактированиеКартыСклада.Форма.ФормаОстатокНаЯчейке"
				, ПараметрыФормы
				, ЭтотОбъект
				, // <Уникальность>
				, // <Окно>
				, // <НавигационнаяСсылка>
				, // <ОписаниеОповещенияОЗакрытии>
				, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры



#Область СобытияФормы

&НаСервере
Процедура ПриОткрытииНаСервере()
	УстановитьРазмерыЯчеек();
	
	СтруктураНастроек	= Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("НастройкаВГХ");
	ИспользуетсяВГХ		= СтруктураНастроек.ИспользоватьВГХ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	АвтообновлениеКарты = Истина;
	ЧастотаАвтобновленияКарты = 120;
	
	ВключитьОбработчикОжидания();
КонецПроцедуры


&НаКлиенте
Процедура КартаСкладаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КартаСкладаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектыСклада.ТекущиеДанные;
	ИндексТекущейСтроки = ОбъектыСклада.Индекс(ТекущиеДанные);
	
	ПодставитьПолеШаблона(КартаСклада.ТекущаяОбласть, Элементы.ОбъектыСклада.ТекущаяСтрока);
	ОбновитьСписокОбъектовСклада();
	
	ИдентификаторТекущейСтроки = Неопределено;
	Попытка
		ИдентификаторТекущейСтроки = ОбъектыСклада.Получить(ИндексТекущейСтроки).ПолучитьИдентификатор();
	Исключение
	КонецПопытки;
	
	Элементы.ОбъектыСклада.ТекущаяСтрока = ИдентификаторТекущейСтроки;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КартаСкладаПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МестаХраненияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	
	Если Строка = Неопределено И МестаХранения.Количество() <> 0 Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	Иначе	
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	ТЗ = МетаданныеКарты.Выгрузить();
	ХЗ = Новый ХранилищеЗначения(ТЗ);
	
	ДанныеДляСохранения = Новый Структура("Склад, СвойстваКартыСклада");
	ДанныеДляСохранения.Склад				= Склад;
	ДанныеДляСохранения.СвойстваКартыСклада	= ХЗ;
	
	ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(ДанныеДляСохранения, "вмс_ХранениеКартСкладов");
	
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	КартаСклада.Очистить();
	МестаХранения.Очистить();
	МетаданныеКарты.Очистить();
	ОтображениеСтеллажа.Очистить();
	
	УстановитьРазмерыЯчеек();
	ОткрытиеСохраненнойКарты();
	ОбновитьСписокОбъектовСклада();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере(ИмяВыделеннойОбласти)
	ТекущаяОбласть	= КартаСклада.Область(ИмяВыделеннойОбласти);
	КопияСвойств	= МетаданныеКарты.Выгрузить();
	
	Для Индекс = 0 По КопияСвойств.Количество() - 1 Цикл
		ИмяОбласти = КопияСвойств[Индекс].Область;
		ОбластьСодержимая = КартаСклада.Область(ИмяОбласти);
		
		Если ВхождениеОднойОбластиВДругую(ОбластьСодержимая, ТекущаяОбласть) Тогда
			НайденныеСтроки = МетаданныеКарты.НайтиСтроки(Новый Структура("Область", ИмяОбласти));
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				МетаданныеКарты.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьОтображениеКарты();
	ОбновитьСписокОбъектовСклада();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ИмяВыделеннойОбласти = КартаСклада.ТекущаяОбласть.Имя;
	УдалитьНаСервере(ИмяВыделеннойОбласти);
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура МетаданныеКартыПриИзмененииНаСервере()
	//ТекущиеСвойства = Элементы.МетаданныеКарты.ТекущиеДанные;
	//ЗаполнитьОбласть(ТекущиеСвойства.МестоХранения, ТекущиеСвойства.Область, ТекущиеСвойства.Цвет);
КонецПроцедуры

&НаКлиенте
Процедура МетаданныеКартыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаСвойств = Элементы.МетаданныеКарты.ТекущиеДанные;
	ИндексСтроки  = МетаданныеКарты.Индекс(СтрокаСвойств);
	
	ЗаполненоОбъектСклада	= ЗначениеЗаполнено(СтрокаСвойств.ОбъектСклада);
	ЗаполненоОбласть		= ЗначениеЗаполнено(СтрокаСвойств.Область);
	
	Если НЕ ЗаполненоОбъектСклада И НЕ ЗаполненоОбласть Тогда
		МетаданныеКарты.Удалить(СтрокаСвойств);
	ИначеЕсли НЕ ЗаполненоОбъектСклада И НЕ ЭтоНеРабочаяЗона(СтрокаСвойств.ТипОбъектаСклада) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле"
		,
		, СтрШаблон("МетаданныеКарты[%1].ОбъектСклада", ИндексСтроки));
	ИначеЕсли НЕ ЗаполненоОбласть Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено поле"
		,
		, СтрШаблон("МетаданныеКарты[%1].Область", ИндексСтроки));
	Иначе
		ОбновитьОтображениеКарты();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МетаданныеКартыПослеУдаления(Элемент)
	ОбновитьОтображениеКарты();
	Модифицированность = Истина;
КонецПроцедуры



#Область ОбновлениеЭлементов


&НаСервере
Процедура ОбновлениеЭлементовНаСервере()
	Если ЗначениеЗаполнено(Склад) Тогда
		ОбновитьОтображениеКарты();
		ОбновитьСписокОбъектовСклада();
		ОбновлениеОтображенияСтеллажа();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбновлениеОтображенияСтеллажа()
	ИмяСтеллажа		 = Элементы.ОтображениеСтеллажа.Заголовок;
	НайденныеОбъекты = МетаданныеКарты.НайтиСтроки(Новый Структура("ОбъектСклада", ИмяСтеллажа));
	
	Для каждого НайденныйОбъект Из НайденныеОбъекты Цикл
		ДетализацияОбъектаСклада(НайденныйОбъект.ОбъектСклада);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ОбновлениеЭлементов()
	ОбновлениеЭлементовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АвтообновлениеЭлементов()
	ОбновлениеЭлементов();
	ПодключитьОбработчикОжидания("АвтообновлениеЭлементов", ЧастотаАвтобновленияКарты, Истина);
КонецПроцедуры


&НаКлиенте
Процедура ЧастотаАвтобновленияКартыПриИзменении(Элемент)
	ОбновитьОбработчикОжидания();
КонецПроцедуры


&НаКлиенте
Процедура АвтообновлениеКартыПриИзменении(Элемент)
	Элементы.ЧастотаАвтобновленияКарты.Доступность = АвтообновлениеКарты;
	
	Если АвтообновлениеКарты Тогда
		ВключитьОбработчикОжидания();
	Иначе
		ВыключитьОбработчикОжидания();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОбработчикОжидания()
	ВыключитьОбработчикОжидания();
	ВключитьОбработчикОжидания();
КонецПроцедуры


&НаКлиенте
Процедура ВключитьОбработчикОжидания()
	ПодключитьОбработчикОжидания("АвтообновлениеЭлементов", ЧастотаАвтобновленияКарты, Истина);
КонецПроцедуры


&НаКлиенте
Процедура ВыключитьОбработчикОжидания()
	ОтключитьОбработчикОжидания("АвтообновлениеЭлементов");
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновлениеЭлементов()
КонецПроцедуры


&НаСервере
Процедура ОбновитьОтображениеКарты()
	КартаСклада.Очистить();
	УстановитьРазмерыЯчеек();
	ЗаполнитьКартуИзМетоданных();
КонецПроцедуры


&НаСервере
Процедура ОбновитьСписокОбъектовСклада()
	//СписокЯчеек = СписокМестХранения(Склад);
	СписокОбъектовСклада = СписокОбъектовСклада(Склад);

	Если НЕ ЗначениеЗаполнено(СписокОбъектовСклада) ИЛИ СписокОбъектовСклада.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон("В системе отсутствует информация по местам хранения у помещения - ""%1""", Склад);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//МестаХранения.Загрузить(СписокЯчеек);
	ОбъектыСклада.Очистить();
	ОбъектыСклада.Загрузить(СписокОбъектовСклада);
КонецПроцедуры


#КонецОбласти



&НаКлиенте
Процедура ОбъектыСкладаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Элементы.КартаСклада.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыСкладаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Элементы.КартаСклада.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура КартаСкладаВыборНаСервере(ИмяОбласти)
	НайденныеСтроки = МетаданныеКарты.НайтиСтроки(Новый Структура("Область", ИмяОбласти));
	
	Если НайденныеСтроки.Количество() = 0 ИЛИ НЕ ЭтоСтеллаж(НайденныеСтроки[0].ТипОбъектаСклада) Тогда
		ОбщегоНазначения.СообщитьПользователю("Объект склада не является стеллажем!");
		Возврат;
	КонецЕсли;
	
	ДетализацияОбъектаСклада(НайденныеСтроки[0].ОбъектСклада);
КонецПроцедуры

&НаКлиенте
Процедура КартаСкладаВыбор(Элемент, Область, СтандартнаяОбработка)
	//КартаСкладаВыборНаСервере(Область.Имя);
	
	НайденныеСтроки = МетаданныеКарты.НайтиСтроки(Новый Структура("Область", Область.Имя));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Если ЭтоСтеллаж(НайденныеСтроки[0].ТипОбъектаСклада) Тогда
			ДетализацияОбъектаСклада(НайденныеСтроки[0].ОбъектСклада);
		ИначеЕсли ЭтоОднаИзРабочихЗон(НайденныеСтроки[0].ТипОбъектаСклада) Тогда
			ОткрытьФормуОстаткиНаЯчейке(НайденныеСтроки[0].ОбъектСклада, Склад)
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартаСкладаПриАктивизации(Элемент)
	ИмяТекущейОбласти = Элемент.ТекущаяОбласть.Имя;
	
	НайденныеСтроки = МетаданныеКарты.НайтиСтроки(Новый Структура("Область", ИмяТекущейОбласти));
	
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		//Индекс = НайденнаяСтрока.Индекс();
		Элементы.МетаданныеКарты.ТекущаяСтрока = МетаданныеКарты.Индекс(НайденнаяСтрока);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ОтображениеСтеллажаВыборНаСервере(ИмяЯчейки)

КонецПроцедуры

&НаКлиенте
Процедура ОтображениеСтеллажаВыбор(Элемент, Область, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("ИмяЯчейки, Склад");
	ПараметрыФормы.ИмяЯчейки = Область.Текст;
	ПараметрыФормы.Склад	 = Склад;
	
	ОткрытьФорму("Обработка.вмс_ИнтерактивноеРедактированиеКартыСклада.Форма.ФормаОстатокНаЯчейке"
				, ПараметрыФормы
				, ЭтотОбъект
				, // <Уникальность>
				, // <Окно>
				, // <НавигационнаяСсылка>
				, // <ОписаниеОповещенияОЗакрытии>
				, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМетаданныеКартыПриИзменении(Элемент)
	Элементы.МетаданныеКарты.Видимость = ОткрытьМетаданныеКарты;
КонецПроцедуры

#КонецОбласти
